In [1]:
import pandas as pd

C:\Users\Waris Hayyat\AppData\Local\Temp\ipykernel_12308\2035458946.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [32]:
var1=pd.DataFrame({"part1":[1,2,3,4] , "Part2":[11,12,13,14]
})
var2=pd.DataFrame({"part1":[1,2,3,5], "res":[21,22,23,24]})
pd.merge(var2,var1)

   part1  res  Part2
0      1   21     11
1      2   22     12
2      3   23     13

In [19]:
pd.merge(var2,var1,how="left")

   part1  res  Part2
0      1   21   11.0
1      2   22   12.0
2      3   23   13.0
3      5   24    NaN

In [20]:
pd.merge(var2,var1,how="right")

   part1   res  Part2
0      1  21.0     11
1      2  22.0     12
2      3  23.0     13
3      4   NaN     14

In [22]:
pd.merge(var2,var1,how="outer",indicator=True)

   part1   res  Part2      _merge
0      1  21.0   11.0        both
1      2  22.0   12.0        both
2      3  23.0   13.0        both
3      4   NaN   14.0  right_only
4      5  24.0    NaN   left_only

In [24]:
var1=pd.DataFrame({"part1":[1,2,3,4] , "Part2":[11,12,13,14]
})
var2=pd.DataFrame({"part1":[1,2,3,5], "Part2":[21,22,23,24]})
pd.merge(var2,var1)

Empty DataFrame
Columns: [part1, Part2]
Index: []

In [25]:
pd.merge(var1,var2,left_index=True,right_index=True)

   part1_x  Part2_x  part1_y  Part2_y
0        1       11        1       21
1        2       12        2       22
2        3       13        3       23
3        4       14        5       24

In [31]:
pd.merge(var1,var2,left_index=True,right_index=True,suffixes=("Name","Python"))

   part1Name  Part2Name  part1Python  Part2Python
0          1         11            1           21
1          2         12            2           22
2          3         13            3           23
3          4         14            5           24